In [3]:
import pandas as pd
import numpy as np

# 读取文件

In [4]:
#通过read_csv 读取csv
data = pd.read_csv('data1.csv')
data

    name  age    sex
0    joe   18    men
1  susan   19    NaN
2   anne   20  women

In [14]:
data = pd.read_csv('data3.txt',sep = ';')
data

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

In [27]:
#通过read_excel读取表格
data = pd.read_excel('data2.xlsx')
data

   age   name    sex
0   20    joe    man
1   19  susan  women
2   18   anne  women

In [30]:
#保存文件
df = pd.DataFrame({
    'name':['joe','susan','anne'],
    'age':[20,19,18],
    'sex':['man','women','women']
})
df.to_csv('name1.csv',index = False)
# df.to_excel('name1.xlsx')

In [31]:
data = pd.read_csv('name1.csv')
data

   age   name    sex
0   20    joe    man
1   19  susan  women
2   18   anne  women

# 缺失值得处理办法

In [5]:
df5 = pd.read_csv('data1.csv')
df5['address'] = np.NaN
df5.loc[3] = np.NaN
df5

    name   age    sex  address
0    joe  18.0    men      NaN
1  susan  19.0    NaN      NaN
2   anne  20.0  women      NaN
3    NaN   NaN    NaN      NaN

In [6]:
#数据过滤
df6 = df5[df5.columns[0:3]]
df6

    name   age    sex
0    joe  18.0    men
1  susan  19.0    NaN
2   anne  20.0  women
3    NaN   NaN    NaN

In [44]:
#检测是否为空
print(df5.isnull())
print(df5.notnull())

    name    age    sex  address
0  False  False  False     True
1  False  False   True     True
2  False  False  False     True
3   True   True   True     True
    name    age    sex  address
0   True   True   True    False
1   True   True  False    False
2   True   True   True    False
3  False  False  False    False
    name   age    sex  address
0    joe  18.0    men      NaN
1  susan  19.0    NaN      NaN
2   anne  20.0  women      NaN
3    NaN   NaN    NaN      NaN

In [51]:
#处理空值
# df5.dropna()  #默认包含控制的行就会删除
# df5
# df5.dropna(how = 'all')  #删除整行为空值的内容
# df5.dropna(how = 'all',axis = 1)  #删除整列为空值的内容

    name   age    sex
0    joe  18.0    men
1  susan  19.0    NaN
2   anne  20.0  women
3    NaN   NaN    NaN

In [62]:
df7 = pd.DataFrame(np.random.randint(1,10,(4,4)))
df7.loc[1:2,1] = np.NaN
df7.loc[1:2,3] = np.NaN
df7

   0    1  2    3
0  1  5.0  8  1.0
1  3  NaN  9  NaN
2  6  NaN  3  NaN
3  8  9.0  4  1.0

In [67]:
#df7.fillna(0)  #给所有缺失值用0填充
# df7.fillna(method = 'ffill') #向前填充
# df7.fillna(method = 'bfill')  #向后填充
# df7.fillna({1:50,3:100})  #指定列填充
df7.replace({np.NaN:100,1:200})  #指定值替换

     0      1  2      3
0  200    5.0  8  200.0
1    3  100.0  9  100.0
2    6  100.0  3  100.0
3    8    9.0  4  200.0

# 层次索引

In [79]:
ser1 = pd.Series([200,201,202,203,205],index = [
    ['2016','2016','2016','2017','2017'],
    ['苹果','香蕉','西瓜','苹果','香蕉']
])
ser1

2016  苹果    200
      香蕉    201
      西瓜    202
2017  苹果    203
      香蕉    205
dtype: int64

In [80]:
ser1['2016']

苹果    200
香蕉    201
西瓜    202
dtype: int64

In [81]:
ser1['2016','苹果']

200

In [103]:
ser1[:,'苹果']

2016    200
2017    203
dtype: int64